slides/unconverted/2013-02-15-mrjob.org
* Lab: mrjob :slide:
  + Understand =review_word_count.py=
  + Find review with most unique words
    + Fill in =unique_review.py=
  + Find similar users
    + Write =user_similarity.py=
** mrjob :notes:
   + Using the Yelp Academic Dataset
   + In lecture, we covered the steps for most unique words
   + Use Jaccard similarity for user\_similarity

* Data :slide:
  + ischool: =~jblomo/yelp_academic_dataset.json=
  + May copy or use in place
** Agreement :notes:
   + Data set only for use academic purposes
   + [[http://www.yelp.com/academic_dataset][Yelp Dataset]]

* Understand review\_word\_count.py :slide:
#+begin_src bash
$ python review_word_count.py yelp_academic_dataset.json

no configs found; falling back on auto-configuration
creating tmp directory /tmp/review_word_count.jim.20130215.071901.095847
reading from file
> /home/jim/src/datamining290/code/venv/bin/python review_word_count.py --step-num=0 --mapper /tmp/review_word_count.jim.20130215.071901.095847/input_part-00000
writing to /tmp/review_word_count.jim.20130215.071901.095847/step-0-mapper_part-00000
Counters from step 1:
  (no counters found)
...
Streaming final output from /tmp/review_word_count.jim.20130215.071901.095847/output
"4"	2
"5"	1
"50"	1
"6"	2
"7"	2
"70s"	1
"9"	2
"a"	46
"abbey"	4
"able"	1
"about"	4
#+end_src

* Fill in unique\_review.py :slide:
  + Mutli-step map reduce
  + Steps are explained in lecture
  + Skeleton in code

* Write user\_similarity.py :slide:
  + Find users >= 0.5 similarity
  + User Similarity: Jaccard similarity of businesses reviewed
  + {BizA, BizB, BizC} ~ {BizF, BizB, BizG}

#+STYLE: <link rel="stylesheet" type="text/css" href="production/common.css" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
#+STYLE: <link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>

#+BEGIN_HTML
<script type="text/javascript" src="production/org-html-slideshow.js"></script>
#+END_HTML

# Local Variables:
# org-export-html-style-include-default: nil
# org-export-html-style-include-scripts: nil
# buffer-file-coding-system: utf-8-unix
# End:
